The collection of analytical openings.
  Namespace:   Autodesk.Revit.DB.Analysis
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  Since:  2012
 Syntax
  C#
public IList<EnergyAnalysisOpening> GetAnalyticalOpenings()
  Visual Basic
Public Function GetAnalyticalOpenings As IList(Of EnergyAnalysisOpening)
  Visual C++
public:
IList<EnergyAnalysisOpening^>^ GetAnalyticalOpenings()
 Return Value
 Returns the analytical openings after model calculation.
 See Also
  EnergyAnalysisDetailModel Class
  Autodesk.Revit.DB.Analysis Namespace